#+TITLE: Deriving temperatures from line widths using MUSE spectra
#+AUTHOR: William Henney
#+EMAIL: will@henney.org


** Table of line wavelengths from OrionMuse project
#+BEGIN_SRC sh :results verbatim
date
cp -av ../OrionMuse/basic-line-list.tab .
#+END_SRC

#+RESULTS:
: Tue Oct 24 21:23:05 CDT 2017
: ../OrionMuse/basic-line-list.tab -> ./basic-line-list.tab
** Random python libraries 
#+BEGIN_SRC sh :results verbatim
date
cp -av ../OrionMuse/misc_utils.py .
#+END_SRC

#+RESULTS:
: Tue Dec 20 23:12:41 GMT 2016
: ../OrionMuse/misc_utils.py -> ./misc_utils.py

** MUSE spectra from nil server
#+BEGIN_SRC sh :results verbatim
  date
  rsync -avzPL --info=progress0 nil:/fs/nil/other0/will/orion-muse/LineMaps/spec1d-*-????.tab spec-data
#+END_SRC

#+RESULTS:
: Tue Oct 24 22:51:32 CDT 2017
: receiving incremental file list
: spec1d-C_II-5342.tab
: 
: sent 48 bytes  received 5,174 bytes  3,481.33 bytes/sec
: total size is 379,119  speedup is 72.60

** MUSE maps from the external disk
+ We want copies of these so we can disconnect the disk and still work
+ We need the mean, sigma, and linesum for all the lines of interest
+ Note that the whole =data/= folder is omitted from the git repo, because it is too large (0.5 GB at the start)
#+name: line-ids
| He_I-5876  |
| He_I-6678  |
| H_I-4861   |
| H_I-6563   |
| H_I-9015   |
| H_I-9229   |
| O_III-4959 |
| O_III-5007 |
| S_III-9069 |
| N_II-6548  |
| N_II-6583  |

#+header: 
#+BEGIN_SRC shell :results drawer :var LINES=line-ids
  SRCDIR=~/Dropbox/OrionMuse/LineMaps
  for line in ${LINES[*]}; do
      echo $line
      rsync -avP $SRCDIR/linesum-$line.fits data
      rsync -avP $SRCDIR/linesum-$line-bin???.fits data
      rsync -avP $SRCDIR/{mean,sigma}-$line-patfixx*.fits data
  done
#+END_SRC

#+RESULTS:
:RESULTS:
He_I-5876
sending incremental file list

sent 69 bytes  received 12 bytes  162.00 bytes/sec
total size is 10,431,360  speedup is 128,782.22
sending incremental file list
linesum-He_I-5876-bin001.fits
         32,768   0%    0.00kB/s    0:00:00       44,049,600 100%  174.91MB/s    0:00:00 (xfr#1, to-chk=8/9)
linesum-He_I-5876-bin002.fits
         32,768   0%  132.78kB/s    0:05:31       44,049,600 100%   88.44MB/s    0:00:00 (xfr#2, to-chk=7/9)
linesum-He_I-5876-bin004.fits
         32,768   0%   67.23kB/s    0:10:54       44,049,600 100%   58.84MB/s    0:00:00 (xfr#3, to-chk=6/9)
linesum-He_I-5876-bin008.fits
         32,768   0%   44.76kB/s    0:16:23       44,049,600 100%   43.94MB/s    0:00:00 (xfr#4, to-chk=5/9)
linesum-He_I-5876-bin016.fits
         32,768   0%   33.44kB/s    0:21:56        7,176,192  16%    6.84MB/s    0:00:05       44,049,600 100%   35.07MB/s    0:00:01 (xfr#5, to-chk=4/9)
linesum-He_I-5876-bin032.fits
         32,768   0%  160.00kB/s    0:04:35       44,049,600 100%   95.47MB/s    0:00:00 (xfr#6, to-chk=3/9)
linesum-He_I-5876-bin064.fits
         32,768   0%   72.56kB/s    0:10:06       44,049,600 100%   62.42MB/s    0:00:00 (xfr#7, to-chk=2/9)
linesum-He_I-5876-bin128.fits
         32,768   0%   47.48kB/s    0:15:27       44,049,600 100%   46.01MB/s    0:00:00 (xfr#8, to-chk=1/9)
linesum-He_I-5876-bin256.fits
         32,768   0%   35.01kB/s    0:20:57       15,892,480  36%   15.16MB/s    0:00:01       44,049,600 100%   36.47MB/s    0:00:01 (xfr#9, to-chk=0/9)

sent 396,543,750 bytes  received 187 bytes  158,617,574.80 bytes/sec
total size is 396,446,400  speedup is 1.00
sending incremental file list

sent 392 bytes  received 12 bytes  808.00 bytes/sec
total size is 834,606,720  speedup is 2,065,858.22
He_I-6678
sending incremental file list

sent 69 bytes  received 12 bytes  162.00 bytes/sec
total size is 10,431,360  speedup is 128,782.22
sending incremental file list
linesum-He_I-6678-bin001.fits
         32,768   0%    0.00kB/s    0:00:00       44,049,600 100%  172.75MB/s    0:00:00 (xfr#1, to-chk=8/9)
linesum-He_I-6678-bin002.fits
         32,768   0%  131.15kB/s    0:05:35       44,049,600 100%   87.52MB/s    0:00:00 (xfr#2, to-chk=7/9)
linesum-He_I-6678-bin004.fits
         32,768   0%   66.39kB/s    0:11:03       44,049,600 100%   58.59MB/s    0:00:00 (xfr#3, to-chk=6/9)
linesum-He_I-6678-bin008.fits
         32,768   0%   44.57kB/s    0:16:27       44,049,600 100%   43.90MB/s    0:00:00 (xfr#4, to-chk=5/9)
linesum-He_I-6678-bin016.fits
         32,768   0%   33.37kB/s    0:21:59        6,324,224  14%    6.03MB/s    0:00:06       44,049,600 100%   35.15MB/s    0:00:01 (xfr#5, to-chk=4/9)
linesum-He_I-6678-bin032.fits
         32,768   0%  162.44kB/s    0:04:30       44,049,600 100%   97.47MB/s    0:00:00 (xfr#6, to-chk=3/9)
linesum-He_I-6678-bin064.fits
         32,768   0%   74.07kB/s    0:09:54       44,049,600 100%   62.79MB/s    0:00:00 (xfr#7, to-chk=2/9)
linesum-He_I-6678-bin128.fits
         32,768   0%   47.76kB/s    0:15:21       44,049,600 100%   45.96MB/s    0:00:00 (xfr#8, to-chk=1/9)
linesum-He_I-6678-bin256.fits
         32,768   0%   34.97kB/s    0:20:58       15,433,728  35%   14.72MB/s    0:00:01       44,049,600 100%   36.43MB/s    0:00:01 (xfr#9, to-chk=0/9)

sent 396,543,746 bytes  received 187 bytes  113,298,266.57 bytes/sec
total size is 396,446,400  speedup is 1.00
sending incremental file list

sent 392 bytes  received 12 bytes  808.00 bytes/sec
total size is 834,606,720  speedup is 2,065,858.22
H_I-4861
sending incremental file list

sent 68 bytes  received 12 bytes  160.00 bytes/sec
total size is 10,431,360  speedup is 130,392.00
sending incremental file list
linesum-H_I-4861-bin001.fits
         32,768   0%    0.00kB/s    0:00:00       44,049,600 100%  172.75MB/s    0:00:00 (xfr#1, to-chk=8/9)
linesum-H_I-4861-bin002.fits
         32,768   0%  131.15kB/s    0:05:35       44,049,600 100%   86.80MB/s    0:00:00 (xfr#2, to-chk=7/9)
linesum-H_I-4861-bin004.fits
         32,768   0%   65.98kB/s    0:11:07       44,049,600 100%   58.18MB/s    0:00:00 (xfr#3, to-chk=6/9)
linesum-H_I-4861-bin008.fits
         32,768   0%   44.26kB/s    0:16:34       44,049,600 100%   43.71MB/s    0:00:00 (xfr#4, to-chk=5/9)
linesum-H_I-4861-bin016.fits
         32,768   0%   33.26kB/s    0:22:03        6,029,312  13%    5.75MB/s    0:00:06       44,049,600 100%   35.15MB/s    0:00:01 (xfr#5, to-chk=4/9)
linesum-H_I-4861-bin032.fits
         32,768   0%  162.44kB/s    0:04:30       44,049,600 100%   96.79MB/s    0:00:00 (xfr#6, to-chk=3/9)
linesum-H_I-4861-bin064.fits
         32,768   0%   73.56kB/s    0:09:58       44,049,600 100%   62.42MB/s    0:00:00 (xfr#7, to-chk=2/9)
linesum-H_I-4861-bin128.fits
         32,768   0%   47.48kB/s    0:15:27       44,049,600 100%   46.16MB/s    0:00:00 (xfr#8, to-chk=1/9)
linesum-H_I-4861-bin256.fits
         32,768   0%   35.13kB/s    0:20:53       15,564,800  35%   14.84MB/s    0:00:01       44,049,600 100%   36.47MB/s    0:00:01 (xfr#9, to-chk=0/9)

sent 396,543,745 bytes  received 187 bytes  158,617,572.80 bytes/sec
total size is 396,446,400  speedup is 1.00
sending incremental file list

sent 390 bytes  received 12 bytes  804.00 bytes/sec
total size is 834,606,720  speedup is 2,076,136.12
H_I-6563
sending incremental file list

sent 68 bytes  received 12 bytes  160.00 bytes/sec
total size is 10,431,360  speedup is 130,392.00
sending incremental file list
linesum-H_I-6563-bin001.fits
         32,768   0%    0.00kB/s    0:00:00       44,049,600 100%  174.18MB/s    0:00:00 (xfr#1, to-chk=8/9)
linesum-H_I-6563-bin002.fits
         32,768   0%  132.23kB/s    0:05:32       44,049,600 100%   85.04MB/s    0:00:00 (xfr#2, to-chk=7/9)
linesum-H_I-6563-bin004.fits
         32,768   0%   64.52kB/s    0:11:22       44,049,600 100%   56.16MB/s    0:00:00 (xfr#3, to-chk=6/9)
linesum-H_I-6563-bin008.fits
         32,768   0%   42.72kB/s    0:17:10       43,810,816  99%   41.78MB/s    0:00:00       44,049,600 100%   42.01MB/s    0:00:01 (xfr#4, to-chk=5/9)
linesum-H_I-6563-bin016.fits
         32,768   0%   15.62MB/s    0:00:02       44,049,600 100%  175.04MB/s    0:00:00 (xfr#5, to-chk=4/9)
linesum-H_I-6563-bin032.fits
         32,768   0%  132.78kB/s    0:05:31       44,049,600 100%   87.34MB/s    0:00:00 (xfr#6, to-chk=3/9)
linesum-H_I-6563-bin064.fits
         32,768   0%   66.39kB/s    0:11:03       44,049,600 100%   58.26MB/s    0:00:00 (xfr#7, to-chk=2/9)
linesum-H_I-6563-bin128.fits
         32,768   0%   44.32kB/s    0:16:33       44,049,600 100%   43.67MB/s    0:00:00 (xfr#8, to-chk=1/9)
linesum-H_I-6563-bin256.fits
         32,768   0%   33.23kB/s    0:22:04        5,963,776  13%    5.69MB/s    0:00:06       44,049,600 100%   34.92MB/s    0:00:01 (xfr#9, to-chk=0/9)

sent 396,543,745 bytes  received 187 bytes  158,617,572.80 bytes/sec
total size is 396,446,400  speedup is 1.00
sending incremental file list

sent 390 bytes  received 12 bytes  804.00 bytes/sec
total size is 834,606,720  speedup is 2,076,136.12
H_I-9015
sending incremental file list

sent 68 bytes  received 12 bytes  160.00 bytes/sec
total size is 10,431,360  speedup is 130,392.00
sending incremental file list
linesum-H_I-9015-bin001.fits
         32,768   0%    0.00kB/s    0:00:00       44,049,600 100%  174.18MB/s    0:00:00 (xfr#1, to-chk=8/9)
linesum-H_I-9015-bin002.fits
         32,768   0%  132.23kB/s    0:05:32       44,049,600 100%   87.88MB/s    0:00:00 (xfr#2, to-chk=7/9)
linesum-H_I-9015-bin004.fits
         32,768   0%   66.81kB/s    0:10:58       44,049,600 100%   58.67MB/s    0:00:00 (xfr#3, to-chk=6/9)
linesum-H_I-9015-bin008.fits
         32,768   0%   44.57kB/s    0:16:27       44,049,600 100%   44.08MB/s    0:00:00 (xfr#4, to-chk=5/9)
linesum-H_I-9015-bin016.fits
         32,768   0%   33.54kB/s    0:21:52        7,962,624  18%    7.59MB/s    0:00:04       44,049,600 100%   35.21MB/s    0:00:01 (xfr#5, to-chk=4/9)
linesum-H_I-9015-bin032.fits
         32,768   0%  164.10kB/s    0:04:28       44,049,600 100%   96.57MB/s    0:00:00 (xfr#6, to-chk=3/9)
linesum-H_I-9015-bin064.fits
         32,768   0%   73.39kB/s    0:09:59       44,049,600 100%   62.70MB/s    0:00:00 (xfr#7, to-chk=2/9)
linesum-H_I-9015-bin128.fits
         32,768   0%   47.69kB/s    0:15:22       44,049,600 100%   46.42MB/s    0:00:00 (xfr#8, to-chk=1/9)
linesum-H_I-9015-bin256.fits
         32,768   0%   35.32kB/s    0:20:46       17,268,736  39%   16.47MB/s    0:00:01       44,049,600 100%   36.98MB/s    0:00:01 (xfr#9, to-chk=0/9)

sent 396,543,745 bytes  received 187 bytes  158,617,572.80 bytes/sec
total size is 396,446,400  speedup is 1.00
sending incremental file list

sent 390 bytes  received 12 bytes  804.00 bytes/sec
total size is 834,606,720  speedup is 2,076,136.12
H_I-9229
sending incremental file list

sent 68 bytes  received 12 bytes  160.00 bytes/sec
total size is 10,431,360  speedup is 130,392.00
sending incremental file list
linesum-H_I-9229-bin001.fits
         32,768   0%    0.00kB/s    0:00:00       44,049,600 100%  182.51MB/s    0:00:00 (xfr#1, to-chk=8/9)
linesum-H_I-9229-bin002.fits
         32,768   0%  138.53kB/s    0:05:17       44,049,600 100%   88.44MB/s    0:00:00 (xfr#2, to-chk=7/9)
linesum-H_I-9229-bin004.fits
         32,768   0%   67.23kB/s    0:10:54       44,049,600 100%   57.86MB/s    0:00:00 (xfr#3, to-chk=6/9)
linesum-H_I-9229-bin008.fits
         32,768   0%   44.02kB/s    0:16:40       44,049,600 100%   43.04MB/s    0:00:00 (xfr#4, to-chk=5/9)
linesum-H_I-9229-bin016.fits
         32,768   0%   32.75kB/s    0:22:23        2,981,888   6%    2.84MB/s    0:00:14       44,049,600 100%   34.32MB/s    0:00:01 (xfr#5, to-chk=4/9)
linesum-H_I-9229-bin032.fits
         32,768   0%  140.97kB/s    0:05:12       44,049,600 100%   87.16MB/s    0:00:00 (xfr#6, to-chk=3/9)
linesum-H_I-9229-bin064.fits
         32,768   0%   66.25kB/s    0:11:04       44,049,600 100%   57.47MB/s    0:00:00 (xfr#7, to-chk=2/9)
linesum-H_I-9229-bin128.fits
         32,768   0%   43.72kB/s    0:16:46       44,049,600 100%   42.74MB/s    0:00:00 (xfr#8, to-chk=1/9)
linesum-H_I-9229-bin256.fits
         32,768   0%   32.52kB/s    0:22:33        1,867,776   4%    1.78MB/s    0:00:23       44,049,600 100%   34.07MB/s    0:00:01 (xfr#9, to-chk=0/9)

sent 396,543,749 bytes  received 187 bytes  158,617,574.40 bytes/sec
total size is 396,446,400  speedup is 1.00
sending incremental file list

sent 390 bytes  received 12 bytes  804.00 bytes/sec
total size is 834,606,720  speedup is 2,076,136.12
O_III-4959
sending incremental file list

sent 70 bytes  received 12 bytes  164.00 bytes/sec
total size is 10,431,360  speedup is 127,211.71
sending incremental file list
linesum-O_III-4959-bin001.fits
         32,768   0%    0.00kB/s    0:00:00       44,049,600 100%  165.27MB/s    0:00:00 (xfr#1, to-chk=8/9)
linesum-O_III-4959-bin002.fits
         32,768   0%  125.49kB/s    0:05:50       44,049,600 100%   82.86MB/s    0:00:00 (xfr#2, to-chk=7/9)
linesum-O_III-4959-bin004.fits
         32,768   0%   62.99kB/s    0:11:38       44,049,600 100%   55.20MB/s    0:00:00 (xfr#3, to-chk=6/9)
linesum-O_III-4959-bin008.fits
         32,768   0%   41.99kB/s    0:17:28       42,303,488  96%   40.34MB/s    0:00:00       44,049,600 100%   41.68MB/s    0:00:01 (xfr#4, to-chk=5/9)
linesum-O_III-4959-bin016.fits
         32,768   0%    3.12MB/s    0:00:13       44,049,600 100%  161.57MB/s    0:00:00 (xfr#5, to-chk=4/9)
linesum-O_III-4959-bin032.fits
         32,768   0%  122.61kB/s    0:05:59       44,049,600 100%   82.37MB/s    0:00:00 (xfr#6, to-chk=3/9)
linesum-O_III-4959-bin064.fits
         32,768   0%   62.62kB/s    0:11:42       44,049,600 100%   55.06MB/s    0:00:00 (xfr#7, to-chk=2/9)
linesum-O_III-4959-bin128.fits
         32,768   0%   41.88kB/s    0:17:30       41,549,824  94%   39.62MB/s    0:00:00       44,049,600 100%   41.51MB/s    0:00:01 (xfr#8, to-chk=1/9)
linesum-O_III-4959-bin256.fits
         32,768   0%    2.23MB/s    0:00:19       44,049,600 100%  150.03MB/s    0:00:00 (xfr#9, to-chk=0/9)

sent 396,543,747 bytes  received 187 bytes  158,617,573.60 bytes/sec
total size is 396,446,400  speedup is 1.00
sending incremental file list

sent 398 bytes  received 12 bytes  820.00 bytes/sec
total size is 834,606,720  speedup is 2,035,626.15
O_III-5007
sending incremental file list

sent 70 bytes  received 12 bytes  164.00 bytes/sec
total size is 10,431,360  speedup is 127,211.71
sending incremental file list
linesum-O_III-5007-bin001.fits
         32,768   0%    0.00kB/s    0:00:00       44,049,600 100%  167.91MB/s    0:00:00 (xfr#1, to-chk=8/9)
linesum-O_III-5007-bin002.fits
         32,768   0%  127.49kB/s    0:05:45       44,049,600 100%   83.68MB/s    0:00:00 (xfr#2, to-chk=7/9)
linesum-O_III-5007-bin004.fits
         32,768   0%   63.62kB/s    0:11:31       44,049,600 100%   55.71MB/s    0:00:00 (xfr#3, to-chk=6/9)
linesum-O_III-5007-bin008.fits
         32,768   0%   42.38kB/s    0:17:18       44,049,600 100%   42.09MB/s    0:00:00 (xfr#4, to-chk=5/9)
linesum-O_III-5007-bin016.fits
         32,768   0%   32.03kB/s    0:22:54           98,304   0%   95.81kB/s    0:07:38       44,049,600 100%   33.99MB/s    0:00:01 (xfr#5, to-chk=4/9)
linesum-O_III-5007-bin032.fits
         32,768   0%  136.17kB/s    0:05:23       44,049,600 100%   89.00MB/s    0:00:00 (xfr#6, to-chk=3/9)
linesum-O_III-5007-bin064.fits
         32,768   0%   67.65kB/s    0:10:50       44,049,600 100%   59.42MB/s    0:00:00 (xfr#7, to-chk=2/9)
linesum-O_III-5007-bin128.fits
         32,768   0%   45.20kB/s    0:16:13       44,049,600 100%   44.22MB/s    0:00:00 (xfr#8, to-chk=1/9)
linesum-O_III-5007-bin256.fits
         32,768   0%   33.65kB/s    0:21:48        8,126,464  18%    7.75MB/s    0:00:04       44,049,600 100%   34.52MB/s    0:00:01 (xfr#9, to-chk=0/9)

sent 396,543,751 bytes  received 187 bytes  158,617,575.20 bytes/sec
total size is 396,446,400  speedup is 1.00
sending incremental file list

sent 394 bytes  received 12 bytes  812.00 bytes/sec
total size is 834,606,720  speedup is 2,055,681.58
S_III-9069
sending incremental file list

sent 70 bytes  received 12 bytes  164.00 bytes/sec
total size is 10,431,360  speedup is 127,211.71
sending incremental file list
linesum-S_III-9069-bin001.fits
         32,768   0%    0.00kB/s    0:00:00       44,049,600 100%  148.33MB/s    0:00:00 (xfr#1, to-chk=8/9)
linesum-S_III-9069-bin002.fits
         32,768   0%  112.68kB/s    0:06:30       44,049,600 100%   73.31MB/s    0:00:00 (xfr#2, to-chk=7/9)
linesum-S_III-9069-bin004.fits
         32,768   0%   55.75kB/s    0:13:09       44,049,600 100%   48.73MB/s    0:00:00 (xfr#3, to-chk=6/9)
linesum-S_III-9069-bin008.fits
         32,768   0%   37.08kB/s    0:19:47       20,807,680  47%   19.84MB/s    0:00:01       44,049,600 100%   36.56MB/s    0:00:01 (xfr#4, to-chk=5/9)
linesum-S_III-9069-bin016.fits
         32,768   0%  211.92kB/s    0:03:27       44,049,600 100%   94.83MB/s    0:00:00 (xfr#5, to-chk=4/9)
linesum-S_III-9069-bin032.fits
         32,768   0%   72.07kB/s    0:10:10       44,049,600 100%   56.31MB/s    0:00:00 (xfr#6, to-chk=3/9)
linesum-S_III-9069-bin064.fits
         32,768   0%   42.84kB/s    0:17:07       37,584,896  85%   35.84MB/s    <0:00:00       44,049,600 100%   40.39MB/s    0:00:01 (xfr#7, to-chk=2/9)
linesum-S_III-9069-bin128.fits
         32,768   0%  761.90kB/s    0:00:57       44,049,600 100%  123.19MB/s    0:00:00 (xfr#8, to-chk=1/9)
linesum-S_III-9069-bin256.fits
         32,768   0%   93.57kB/s    0:07:50       44,049,600 100%   64.73MB/s    0:00:00 (xfr#9, to-chk=0/9)

sent 396,543,747 bytes  received 187 bytes  113,298,266.86 bytes/sec
total size is 396,446,400  speedup is 1.00
sending incremental file list

sent 394 bytes  received 12 bytes  812.00 bytes/sec
total size is 834,606,720  speedup is 2,055,681.58
N_II-6548
sending incremental file list

sent 69 bytes  received 12 bytes  162.00 bytes/sec
total size is 10,431,360  speedup is 128,782.22
sending incremental file list
linesum-N_II-6548-bin001.fits
         32,768   0%    0.00kB/s    0:00:00       44,049,600 100%  139.46MB/s    0:00:00 (xfr#1, to-chk=8/9)
linesum-N_II-6548-bin002.fits
         32,768   0%  105.96kB/s    0:06:55       44,049,600 100%   69.44MB/s    0:00:00 (xfr#2, to-chk=7/9)
linesum-N_II-6548-bin004.fits
         32,768   0%   52.81kB/s    0:13:53       44,049,600 100%   45.96MB/s    0:00:00 (xfr#3, to-chk=6/9)
linesum-N_II-6548-bin008.fits
         32,768   0%   34.97kB/s    0:20:58       12,124,160  27%   11.56MB/s    0:00:02       44,049,600 100%   34.60MB/s    0:00:01 (xfr#4, to-chk=5/9)
linesum-N_II-6548-bin016.fits
         32,768   0%  148.15kB/s    0:04:57       44,049,600 100%   81.26MB/s    0:00:00 (xfr#5, to-chk=4/9)
linesum-N_II-6548-bin032.fits
         32,768   0%   61.78kB/s    0:11:52       44,049,600 100%   51.11MB/s    0:00:00 (xfr#6, to-chk=3/9)
linesum-N_II-6548-bin064.fits
         32,768   0%   38.88kB/s    0:18:52       25,395,200  57%   24.22MB/s    0:00:00       44,049,600 100%   37.41MB/s    0:00:01 (xfr#7, to-chk=2/9)
linesum-N_II-6548-bin128.fits
         32,768   0%  256.00kB/s    0:02:51       44,049,600 100%  101.96MB/s    0:00:00 (xfr#8, to-chk=1/9)
linesum-N_II-6548-bin256.fits
         32,768   0%   77.48kB/s    0:09:28       44,049,600 100%   60.53MB/s    0:00:00 (xfr#9, to-chk=0/9)

sent 396,543,746 bytes  received 187 bytes  113,298,266.57 bytes/sec
total size is 396,446,400  speedup is 1.00
sending incremental file list

sent 396 bytes  received 12 bytes  816.00 bytes/sec
total size is 834,606,720  speedup is 2,045,604.71
N_II-6583
sending incremental file list

sent 69 bytes  received 12 bytes  162.00 bytes/sec
total size is 10,431,360  speedup is 128,782.22
sending incremental file list
linesum-N_II-6583-bin001.fits
         32,768   0%    0.00kB/s    0:00:00       44,049,600 100%  151.00MB/s    0:00:00 (xfr#1, to-chk=8/9)
linesum-N_II-6583-bin002.fits
         32,768   0%  114.70kB/s    0:06:23       44,049,600 100%   75.69MB/s    0:00:00 (xfr#2, to-chk=7/9)
linesum-N_II-6583-bin004.fits
         32,768   0%   57.55kB/s    0:12:44       44,049,600 100%   51.54MB/s    0:00:00 (xfr#3, to-chk=6/9)
linesum-N_II-6583-bin008.fits
         32,768   0%   39.22kB/s    0:18:42       30,081,024  68%   28.69MB/s    0:00:00       44,049,600 100%   38.75MB/s    0:00:01 (xfr#4, to-chk=5/9)
linesum-N_II-6583-bin016.fits
         32,768   0%  372.09kB/s    0:01:58       44,049,600 100%  119.34MB/s    0:00:00 (xfr#5, to-chk=4/9)
linesum-N_II-6583-bin032.fits
         32,768   0%   90.65kB/s    0:08:05       44,049,600 100%   67.54MB/s    0:00:00 (xfr#6, to-chk=3/9)
linesum-N_II-6583-bin064.fits
         32,768   0%   51.36kB/s    0:14:16       44,049,600 100%   48.45MB/s    0:00:00 (xfr#7, to-chk=2/9)
linesum-N_II-6583-bin128.fits
         32,768   0%   36.87kB/s    0:19:53       15,826,944  35%   15.09MB/s    0:00:01       44,049,600 100%   36.18MB/s    0:00:01 (xfr#8, to-chk=1/9)
linesum-N_II-6583-bin256.fits
         32,768   0%  196.32kB/s    0:03:44       44,049,600 100%   92.94MB/s    0:00:00 (xfr#9, to-chk=0/9)

sent 396,543,746 bytes  received 187 bytes  158,617,573.20 bytes/sec
total size is 396,446,400  speedup is 1.00
sending incremental file list

sent 388 bytes  received 12 bytes  800.00 bytes/sec
total size is 834,606,720  speedup is 2,086,516.80
:END:

** Mow much data do we have?
+ Space used up in data folder
#+BEGIN_SRC bash :results verbatim append
date
du -sh data
#+END_SRC

#+RESULTS:
: Tue Dec 20 11:07:47 GMT 2016
:  13G	data

+ Space remaining on disk
#+BEGIN_SRC bash :results verbatim append
date
df -h 
#+END_SRC

#+RESULTS:
: Tue Dec 20 17:25:45 GMT 2016
: Filesystem      Size   Used  Avail Capacity iused      ifree %iused  Mounted on
: /dev/disk1     931Gi  737Gi  194Gi    80% 4332485 4290634794    0%   /
: devfs          186Ki  186Ki    0Bi   100%     642          0  100%   /dev
: map -hosts       0Bi    0Bi    0Bi   100%       0          0  100%   /net
: map auto_home    0Bi    0Bi    0Bi   100%       0          0  100%   /home
: /dev/disk2s2   931Gi  743Gi  188Gi    80%  202673 4294764606    0%   /Volumes/SSD-1TB


* TODO Differences of variance
Make FITS maps of  (\sigma^{2} - \sigma^{2}), which is the fundamental quantity proportional to the temperature

#+name: delta-variance
#+header: :var LINE_A="He_I-7065" LINE_B="Ar_III-7136"
#+header: :var D="~/tmp/musedata" N=4 X=""
#+header: :var FMT="sigma-{0}{2}-bin{1:03d}.fits"
#+header: :var OUTFMT="delta-var-{0}-{1}{3}-bin{2:03d}.fits"
#+BEGIN_SRC python :return fnC :results verbatim
  import os
  import numpy as np
  from astropy.io import fits

  dd = os.path.expanduser(D)

  fnA = os.path.join(dd, FMT.format(LINE_A, N, X))
  fnB = os.path.join(dd, FMT.format(LINE_B, N, X))

  hduA = fits.open(fnA)['SCALED']
  hduB = fits.open(fnB)['SCALED']

  fnC = os.path.join(dd, OUTFMT.format(LINE_A, LINE_B, N, X))

  fits.PrimaryHDU(
      header=hduA.header,
      data=hduA.data**2 - hduB.data**2
  ).writeto(fnC, clobber=True)
#+END_SRC

#+RESULTS: delta-variance
: /Users/will/tmp/musedata/delta-var-He_I-7065-Ar_III-7136-bin004.fits

#+call: delta-variance(N=64)

#+RESULTS:
: /Users/will/tmp/musedata/delta-var-He_I-7065-Ar_III-7136-bin064.fits

#+call: delta-variance(N=16)

#+RESULTS:
: /Users/will/tmp/musedata/delta-var-He_I-7065-Ar_III-7136-bin016.fits


* Interpolating [O III] width to H beta wavelength
+ 5006.84 - 4959.91 = 46.93
+ 4959.91 - 4861.32 = 98.59
+ 98.59/46.93 = 2.10079
+ So we can take Var([O III] @ 4861) to be either of 
  + Var(4959) - 2.10079 [Var(4959) - Var(5007)]
  + Var(5007) - 3.10079 [Var(4959) - Var(5007)]
+ And we calculate Var(4861) - Var([O III] @ 4861)

#+name: extrapolated-delta-variance
#+header: :var LINE_A="H_I-4861" 
#+header: :var LINE_B1="O_III-4959" LINE_B2="O_III-5007"
#+header: :var FACTOR=2.10079
#+header: :var D="~/tmp/musedata" N=64 X="" 
#+header: :var FMT="sigma-{0}{2}-bin{1:03d}.fits"
#+header: :var OUTFMT="delta-var-{0}-{1}{3}-bin{2:03d}.fits"
#+BEGIN_SRC python :return fnC :results verbatim
  import os
  import numpy as np
  from astropy.io import fits

  ionA, wavA = LINE_A.split('-')
  ionB, wav1 = LINE_B1.split('-')
  _, wav2 = LINE_B2.split('-')
  assert _ == ionB, 'Ions B1, B2 must be the same: {}, {}'.format(ionB, _)

  dd = os.path.expanduser(D)

  fnA = os.path.join(dd, FMT.format(LINE_A, N, X))
  fnB1 = os.path.join(dd, FMT.format(LINE_B1, N, X))
  fnB2 = os.path.join(dd, FMT.format(LINE_B2, N, X))

  hduA = fits.open(fnA)['SCALED']
  hduB1 = fits.open(fnB1)['SCALED']
  hduB2 = fits.open(fnB2)['SCALED']

  extrapolated_variance = hduB1.data**2 + FACTOR*(hduB1.data**2 - hduB2.data**2)

  line_b = '{}-at-{}'.format(ionB, wavA)
  fnC = os.path.join(dd, OUTFMT.format(LINE_A, line_b, N, X))

  fits.PrimaryHDU(
      header=hduA.header,
      data=hduA.data**2 - extrapolated_variance
  ).writeto(fnC, clobber=True)
#+END_SRC

#+RESULTS: extrapolated-delta-variance
: /Users/will/tmp/musedata/delta-var-H_I-4861-O_III-at-4861-bin064.fits

+ This is reasonable, but the final map could do with more tweaking.
+ The variation in 4959 - 5007 within the patches looks reasonable
+ But it goes funny in the fainter parts to the east
  + So maybe take average within patch, like we did with the patfic stuffZ 
+ Now try the same, but with the patfixx versions

#+call: extrapolated-delta-variance(D="data", X="-patfixx")

#+RESULTS:
: data/delta-var-H_I-4861-O_III-at-4861-patfixx-bin064.fits

